---
kind: property
id: P:Autodesk.Revit.DB.FaceArray.Item(System.Int32)
source: html/4dc2e67d-ed39-ff96-ae61-989be05e48fb.htm
---
# Autodesk.Revit.DB.FaceArray.Item Property

Gets or sets a face at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Face this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the face to be set or retrieved.

## Returns
Returns the face at the specified index.